In [32]:
import pandas as pd
import numpy as np

#### None:Pythonic missing data

In [2]:
vals = np.array([1, None, 2, 3])
vals

array([1, None, 2, 3], dtype=object)

In [6]:
#addition between integer and None is undefined
vals.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### NaN:Missing Numerical Data

In [11]:
# acronym of not a number
# NaN:a special floating-point value recognized by all systems that use the standard IEEE floating-point representation
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [15]:
# NaNaN is a bit like a data virus—it infects any other object it touches. 
# Regardless of the operation, the result of arithmetic with NaN will be another NaN

print(1 + np.nan)
print(2 * np.nan)

nan
nan

In [21]:
# Even though aggregates over the values are well-defined, they result in error
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [23]:
# numpy provides some special aggregates that will ignores that missing values
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

#### NaN and None in Pandas

In [28]:
# type casting NA to NaN
x = pd.Series(np.arange(2), dtype = int)
x

0    0
1    1
dtype: int64

In [30]:
# in addition to casting the integer array to floating point, Pandas automati‐cally 
# converts the None to a NaN value.
x[0] = None
x

0    NaN
1    1.0
dtype: float64

#### Table of Pandas handling of NAs by type

In [31]:
A = pd.Series(['floating', 'object', 'integer', 'boolean'])
B = pd.Series(['NoChange', 'NoChange', 'Cast to Float64', 'Cast to Object'])
C = pd.Series(['np.nan', 'None or np.nan', 'np.nan', 'None or np.nan'])

df = pd.DataFrame({'TypeClass':A, 'Conversion when storing NAs':B, 'NA sentinal Value':C})
df

  TypeClass Conversion when storing NAs NA sentinal Value
0  floating                    NoChange            np.nan
1    object                    NoChange    None or np.nan
2   integer             Cast to Float64            np.nan
3   boolean              Cast to Object    None or np.nan

#### Detecting Null values

In [34]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [36]:
#Boolean masking can be used directly as Series or DataFrame Index
data[data.notnull()]

0        1
2    hello
dtype: object

#### Dropping Null Values

In [43]:
#For a series, the result is straightforward
data.dropna()

0        1
2    hello
dtype: object

In [45]:
#For a DataFrame, We cannot drop single values from a DataFrame ; we can only drop full rows or full columns
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [51]:
#By default, dropna() will drop all rows in which any null value is present:
df.dropna() #equivalent to df.dropna(axis='rows'), df.dropna(axis=0) Column-wise

     0    1  2
1  2.0  3.0  5

In [52]:
df.dropna(axis='columns') #equivalent to df.dropna(axis=1) #row-wise

   2
0  2
1  5
2  6

#### Dropping specific null values with "how" and "thresh" keywords

In [54]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [57]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [59]:
df.dropna(axis=1, how='all') #how='all' will only drop rows or columns that are all null values

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [66]:
#thresh parameter let you specify the minimum number of non-null values for the rows/columns to keep
df.dropna(axis = 'rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

#### Filling null values

In [67]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [68]:
#Filling single value
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [69]:
#Forward Fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [70]:
#Back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [71]:
#For DataFrame, axis can be specified
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [72]:
df.fillna(axis=1, method='ffill')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

##### Previous value not available in Foward Fill, NaN value can be remained